In [1]:
import pandas as pd
reviews = pd.read_csv("C:\\Users\\ruchi\\OneDrive\\Desktop\\data.csv", index_col=0)
pd.set_option("display.max_rows", 5)

In [2]:
reviews.groupby('price').price.count()

price
0.0           49
7800.0         1
              ..
12899000.0     1
26590000.0     1
Name: price, Length: 1741, dtype: int64

In [3]:
reviews.groupby('price').price.min()

price
0.0                  0.0
7800.0            7800.0
                 ...
12899000.0    12899000.0
26590000.0    26590000.0
Name: price, Length: 1741, dtype: float64

In [6]:
reviews.groupby('bedrooms').apply(lambda df: df.city.iloc[0])

bedrooms
0.0    Seattle
1.0     Burien
        ...
8.0    Seattle
9.0    Seattle
Length: 10, dtype: str

In [8]:
reviews.groupby(['country', 'bedrooms']).apply(lambda df: df.loc[df.price.idxmax()])

                           2014-06-24 00:00:00  price  bathrooms  sqft_living  \
country bedrooms
USA     0.0      price               1295648.0    NaN        NaN          NaN
                 bathrooms                 0.0    NaN        NaN          NaN
...                                        ...    ...        ...          ...
        9.0      city                      NaN    NaN        NaN          NaN
                 statezip                  NaN    NaN        NaN          NaN

                            sqft_lot  floors  waterfront  view  condition  \
country bedrooms
USA     0.0      price           NaN     NaN         NaN   NaN        NaN
                 bathrooms       NaN     NaN         NaN   NaN        NaN
...                              ...     ...         ...   ...        ...
        9.0      city            NaN     NaN         NaN   NaN        NaN
                 statezip        NaN     NaN         NaN   NaN        NaN

                            sqft_above  sqft_basement  yr_built  yr_renovated  \
country bedrooms
USA     0.0      price             NaN            NaN       NaN           NaN
                 bathrooms         NaN            NaN       NaN           NaN
...                                ...            ...       ...           ...
        9.0      city              NaN            NaN       NaN           NaN
                 statezip          NaN            NaN       NaN           NaN

                           street city statezip 2014-05-28 00:00:00  \
country bedrooms
USA     0.0      price        NaN  NaN      NaN                 NaN
                 bathrooms    NaN  NaN      NaN                 NaN
...                           ...  ...      ...                 ...
        9.0      city         NaN  NaN      NaN                 NaN
                 statezip     NaN  NaN      NaN                 NaN

                           2014-05-07 00:00:00
country bedrooms
USA     0.0      price                     NaN
                 bathrooms                 NaN
...                                        ...
        9.0      city                  Seattle
                 statezip             WA 98103

[132 rows x 18 columns]

In [9]:
reviews.groupby(['country']).price.agg([len, min, max])

          len  min         max
country
USA      4600  0.0  26590000.0

In [20]:
countries_reviewed = reviews.groupby(['country', 'city']).street.agg([len])
countries_reviewed

                      len
country city
USA     Algona          5
        Auburn        176
...                   ...
        Woodinville   115
        Yarrow Point    4

[44 rows x 1 columns]

In [21]:
mi = countries_reviewed.index
type(mi)

pandas.MultiIndex

In [22]:
countries_reviewed.reset_index()

   country          city  len
0      USA        Algona    5
1      USA        Auburn  176
..     ...           ...  ...
42     USA   Woodinville  115
43     USA  Yarrow Point    4

[44 rows x 3 columns]

In [23]:
countries_reviewed = countries_reviewed.reset_index()
countries_reviewed.sort_values(by='len')

   country                 city   len
2      USA   Beaux Arts Village     1
15     USA  Inglewood-Finn Hill     1
..     ...                  ...   ...
32     USA               Renton   293
35     USA              Seattle  1573

[44 rows x 3 columns]

In [24]:
countries_reviewed.sort_values(by='len', ascending=False)

   country                 city   len
35     USA              Seattle  1573
32     USA               Renton   293
..     ...                  ...   ...
15     USA  Inglewood-Finn Hill     1
39     USA      Snoqualmie Pass     1

[44 rows x 3 columns]

In [25]:
countries_reviewed.sort_index()

   country          city  len
0      USA        Algona    5
1      USA        Auburn  176
..     ...           ...  ...
42     USA   Woodinville  115
43     USA  Yarrow Point    4

[44 rows x 3 columns]

In [26]:
countries_reviewed.sort_values(by=['country', 'len'])

   country                 city   len
2      USA   Beaux Arts Village     1
15     USA  Inglewood-Finn Hill     1
..     ...                  ...   ...
32     USA               Renton   293
35     USA              Seattle  1573

[44 rows x 3 columns]